TestPlans/Car/Debenhams/xml/DCI3_21112014_9.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="www.openecommerce.co.uk">
  <soap:Body>
    <ns1:getQuote>
      <requestXML>&lt;Request&gt;
  &lt;Product&gt;Motor&lt;/Product&gt;
  &lt;AggregatorID&gt;CTM1708&lt;/AggregatorID&gt;
  &lt;Quote Id="1"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="2"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="3"&gt;
    &lt;BrokerReference&gt;ELD19010&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="4"&gt;
    &lt;BrokerReference&gt;DSI0012606&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="5"&gt;
    &lt;BrokerReference&gt;PRC2407&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="6"&gt;
    &lt;BrokerReference&gt;INC807&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="7"&gt;
    &lt;BrokerReference&gt;EDB0311&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
&lt;/Request&gt;</requestXML>
      <riskXML>&lt;Risk&gt;
  &lt;Policy&gt;
    &lt;CoverDate&gt;09/12/2014&lt;/CoverDate&gt;
    &lt;InsCancelled abiCode="Y" /&gt;
    &lt;InsRefused abiCode="Y" /&gt;
    &lt;ImposedTerms abiCode="Y" /&gt;
    &lt;PrevPayment&gt;M&lt;/PrevPayment&gt;
    &lt;VolExcess&gt;0&lt;/VolExcess&gt;
    &lt;TotalVehiclesInHousehold&gt;1&lt;/TotalVehiclesInHousehold&gt;
  &lt;/Policy&gt;
  &lt;Person&gt;
    &lt;ContactEmail&gt;transformerPC09@emailreaction.org&lt;/ContactEmail&gt;
    &lt;ContactTelephone&gt;01733345678&lt;/ContactTelephone&gt;
    &lt;ContactAlternatePhone&gt;01733345678&lt;/ContactAlternatePhone&gt;
    &lt;Address1&gt;102-104 Hi-Park Centre&lt;/Address1&gt;
    &lt;Address2&gt;High Street&lt;/Address2&gt;
    &lt;Address3&gt;Belfast&lt;/Address3&gt;
    &lt;Address4 /&gt;
    &lt;PostCode&gt;BT1 2JZ&lt;/PostCode&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="Y" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="N" /&gt;
    &lt;PersonalBus abiCode="N" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="N" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="N" /&gt;
    &lt;DateMovedToUK&gt;1973-09-25&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;25/09/1973&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="M" /&gt;
    &lt;FirstName&gt;Ian&lt;/FirstName&gt;
    &lt;Gender abiCode="M" /&gt;
    &lt;HasNonMotorConv abiCode="Y" /&gt;
    &lt;HomeOwner abiCode="N" /&gt;
    &lt;LicHeld&gt;9&lt;/LicHeld&gt;
    &lt;LicType abiCode="I" /&gt;
    &lt;LicUnit&gt;Y&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="S" /&gt;
    &lt;OtherCompanyVehYears&gt;9&lt;/OtherCompanyVehYears&gt;
    &lt;Surname&gt;Nine&lt;/Surname&gt;
    &lt;Title&gt;Mr&lt;/Title&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;0&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;Y&lt;/AtFault&gt;
      &lt;IncidentType&gt;NoV&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="Y" /&gt;
      &lt;ClaimDate&gt;01/04/2012&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;0.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="A" /&gt;
      &lt;NCBAff&gt;Y&lt;/NCBAff&gt;
      &lt;Date&gt;01/04/2012&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="186" /&gt;
      &lt;EmpStat abiCode="H" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="163" /&gt;
    &lt;/Occupation&gt;
    &lt;PrivateMileage&gt;2000&lt;/PrivateMileage&gt;
  &lt;/Person&gt;
  &lt;Person&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="N" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="N" /&gt;
    &lt;PersonalBus abiCode="N" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="N" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="N" /&gt;
    &lt;DateMovedToUK&gt;1984-02-12&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;12/02/1984&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="F" /&gt;
    &lt;FirstName&gt;Ibrahim&lt;/FirstName&gt;
    &lt;Gender abiCode="M" /&gt;
    &lt;HasNonMotorConv abiCode="Y" /&gt;
    &lt;LicCountry abiCode="GB" /&gt;
    &lt;LicHeld&gt;4&lt;/LicHeld&gt;
    &lt;LicType abiCode="E" /&gt;
    &lt;LicUnit&gt;Y&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="P" /&gt;
    &lt;Surname&gt;Nine&lt;/Surname&gt;
    &lt;Title&gt;Mr&lt;/Title&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;0&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;Y&lt;/AtFault&gt;
      &lt;IncidentType&gt;NoV&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="N" /&gt;
      &lt;ClaimDate&gt;01/04/2011&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;500.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="S" /&gt;
      &lt;NCBAff&gt;Y&lt;/NCBAff&gt;
      &lt;Date&gt;01/04/2011&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="077" /&gt;
      &lt;EmpStat abiCode="E" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="60B" /&gt;
    &lt;/Occupation&gt;
    &lt;RelationshipToProp abiCode="C" /&gt;
  &lt;/Person&gt;
  &lt;Vehicle&gt;
    &lt;ABICode&gt;31520102&lt;/ABICode&gt;
    &lt;AlarmSecurityFitted&gt;Unknown&lt;/AlarmSecurityFitted&gt;
    &lt;ImmobSecurityMake&gt;UT2&lt;/ImmobSecurityMake&gt;
    &lt;ImmobSecurityFitted&gt;Unknown&lt;/ImmobSecurityFitted&gt;
    &lt;CoverType abiCode="03" /&gt;
    &lt;EstimatedValue&gt;5000&lt;/EstimatedValue&gt;
    &lt;Keeper abiCode="4" /&gt;
    &lt;Lhd&gt;N&lt;/Lhd&gt;
    &lt;Modified abiCode="N" /&gt;
    &lt;NCBType&gt;PC&lt;/NCBType&gt;
    &lt;NCBProtected&gt;N&lt;/NCBProtected&gt;
    &lt;NCBYears&gt;9&lt;/NCBYears&gt;
    &lt;NightLocation abiCode="2" /&gt;
    &lt;Owner abiCode="4" /&gt;
    &lt;OvernightPostCode&gt;BT1 2JZ&lt;/OvernightPostCode&gt;
    &lt;PurchaseDate&gt;01/02/2013&lt;/PurchaseDate&gt;
    &lt;Registration&gt;AK05VNH&lt;/Registration&gt;
    &lt;YearManufacture&gt;2005&lt;/YearManufacture&gt;
    &lt;Seats&gt;3&lt;/Seats&gt;
  &lt;/Vehicle&gt;
&lt;/Risk&gt;</riskXML>
    </ns1:getQuote>
  </soap:Body>
</soap:Envelope>